Функция: Перемещение корабля

Сценарий: Игровой объект может перемещаться по прямой 
космический корабль находится в точке пространства с координатами (12, 5)
имеет мгновенную скорость (-5, 3)
происходит прямолинейное равномерное движение без деформации
космический корабль перемещается в точку пространства с координатами (7, 8) 


Сценарий: Если невозможно определить текущее положение игрового объекта в пространстве, то перемещение по прямой невозможно 
космический корабль, положение в пространстве которого невозможно определить
имеет мгновенную скорость (-5, 3)
происходит прямолинейное равномерное движение без деформации
возникает ошибка Exception 


Сценарий: Если невозможно определить мгновенную скорость игрового объекта, то перемещение по прямой невозможно 
космический корабль находится в точке пространства с координатами (12, 5)
скорость корабля определить невозможно
происходит прямолинейное равномерное движение без деформации
возникает ошибка Exception 


Сценарий: Если невозможно изменить положение игрового объекта в пространстве, то перемещение по прямой невозможно 
космический корабль находится в точке пространства с координатами (12, 5)
имеет мгновенную скорость (-5, 3)
изменить положение в пространстве космического корабля невозможно
происходит прямолинейное равномерное движение без деформации
возникает ошибка Exception 
